Tekla Open API Reference for Tekla Structures 2025
ReferenceModel.Revision Structure
 Reference model revision.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public struct Revision
Public Structure Revision
The ReferenceModel.Revision type exposes the following members.
Constructors
Name | Description
ReferenceModel.Revision
 Parameterized constructor.
Top
Properties
Name | Description
FileName
 Gets the revision file name.
Hash
 Gets the revision hash identifier.
Id
 Gets the revision id.
IsCurrentRevision
 Gets the value indicating whether this revision is the current revision or not.
ReferenceModelId
 Gets or sets the parent reference model id.
Time
 Gets the revision time.
Top
See Also
Reference
Tekla.Structures.Model Namespace